# 교차분석(카이제곱, 카이스퀘어) 가설 검정
# 범주형 자료(변수)를 대상으로 교차빈도에 대한 기술 통계량을 사용
# 교차 빈도에 대한 통계적 유의성을 검증해주는 분석 기법

# 분산이 퍼져 있는 모습을 분포로 만든 것이 카이제곱 분포이다.
# 독립성, 적합도 검정, 분산에 대한 검정, 회귀 분석의 잔차 제곱합(SSE) 분석
# 특징 : 항상 양수, 비대칭적 분포(자유도에 따라 모양이 변한다.)

# 실습 - 적합도 검정

# 가설을 채택하는 두 가지 방법 연습
import pandas as pd

# 공부 여부와 합격 여부 사이에 연관성(독립성)이 있는가?
data = pd.read_csv('pass_cross.csv', encoding='euc-kr')
print(data.head(5))
print(data.shape)
print()

# 귀무가설(H0) : 벼락치기 공부와 합격 여부 사이에는 관계가 없다.
# 대립가설(H1) : 벼락치기 공부와 합격 여부 사이에는 관계가 있다.

print(data[(data['공부함'] == 1) & (data['합격'] == 1)].shape[0])   # 18
print(data[(data['공부함'] == 1) & (data['불합격'] == 1)].shape[0]) # 7

print('방법 1: 빈도표 사용 ---- ')
ctab = pd.crosstab(index=data['공부안함'], columns=data['불합격'], margins=True)
ctab.columns = ['합격', '불합격', '합계']
ctab.index = ['공부함', '공부안함', '합계']
print(ctab) # 관찰값(빈도)
# 기대도수 = (각 행의 주변합) * (각 열의 주변합) / 총합(전체 표본수)
chi2 = ((18 - 15) ** 2 / 15 + (7 - 10) ** 2 / 10 + (12 - 15) ** 2 / 15 + (13 - 10) ** 2 / 10)
print(f'검정통계량 chi2 : {chi2}')
# df = 2 - 1 = 1
# 유의수준 : 0.05
# 임계값(Critical Value) - H0의 기각 여부를 결정하는 threshold : 3.84 (chi squre table) 
# 판정 : 검정통계치(3.0) < 임계값 (3.84) 이므로 귀무가설이 채택된다.
# 그러므로 '벼락치기 공부와 합격 여부 사이에는 관계가 없다.'라는 의견은 유지된다.

print('\n방법 2: p-value 사용 ---- ')

import scipy.stats as stats
observed = ctab.iloc[:2, :2]    # 합계행/합계열은 제외함
chi2, p, _, _ = stats.chi2_contingency(observed,correction=False)
print('검정 통계량 : ', chi2)   # 3.0
print('유의 확률 (p값) : ', p)  # 0.5578254003710748
# 판정 : 유의수준 0.05 < p(0.55) 이므로, 귀무가설이 채택된다.

# 검정의 대상이 된 차이는 단지 우연에 의한 것이라고 할 수 있다. 
# 유의슈준 5%에서 유의한 연관성이 있다고 판단하기에는 증거가 충분하지 않다.

# 참고 : p-value가 0.05보다 크다고 해서 귀무가설이 옳다는 뜻은 아니다. 확정은 아님
# 현재 데이터만으로 귀무가설을 기각할만큼 충분한 통계적 근거가 없다는 뜻이다. 